# используем образ golang:alpine как базовый
FROM golang:alpine

# создаем директорию для приложения и переходим в нее
WORKDIR /app

# копируем файл go.mod и go.sum в директорию приложения
COPY go.mod go.sum ./

# загружаем зависимости приложения
RUN go mod download

# копируем исходный код в директорию приложения
COPY . .

# собираем приложение
RUN go build -o main cmd/main.go

# устанавливаем порт, на котором будет работать приложение
EXPOSE 8000

# команда для запуска приложения
CMD ["./main"]